USER_NOT_FOUND = 'کاربری با مشخصات ذکر شده شما پیدا نشد.'
BANNED_USER_MAX_LOGIN_ATTEMPTS = 'حساب  کاربری شما موقتا به حالت تعلیق در آمد لطفا با پشتیبانی سایت تماس حاصل کنید.'
USER_NAME_MUST_STRING = 'نام کاربری نمی تواند بصورت عددی باشد.'
USER_NAME_LENGTH = 'نام کاربری باید بین ۳ تا ۳۲ کاراکتر باشد.'
PASSWORD = {
"LENGTH" : 'رمز عبور باید بین ۴ تا ۳۲ کاراکتر باشد.',
"SAME" : 'رمز عبور و تکرار آن باهم مطابقت ندارند.',
"FAILED" : 'رمزعبور فعلی شما نادرست است.',
"CHANGE" : 'رمز عبور شما تغییر یافت. لطفا جهت ورود به سایت از رمز عبور جدید خود استفاده کنید.'
}

LOGIN_REQUIRED = {
"username":'ورود نام کاربری الزامی است.',
"password":'ورود رمز عبور الزامی است.',
}
REGISTER_REQUIRED = {
"username":'ورود نام کاربری الزامی است.',
"password":'ورود رمز عبور الزامی است.',
"confirmPassword":'ورود تکرار رمز عبور الزامی است.',
"mobile":'ورود شماره همراه الزامی است.',
}
CHANGEPASS_REQUIRED = {
"oldPassword":'ورود رمز عبور قبلی الزامی است.',
"newPassword":'ورود رمز عبور جدید الزامی است.',
"confirmPassword":'ورود تکرار رمزعبور جدید الزامی است.',
"currentTime":'ورود زمان فعلی کلاینت الزامی است بطور مثال » ۱۱ فروردین ۱۳۹۸ ساعت ۱۰:۴۵',
}
PASS_VALIDATION = {
"min_length":'رمز عبور انتخابی باید حداقل ۴ کاراکتر باشد.',
"max_length":'رمز عبور انتخابی نمی تواند از ۳۲ کاراکتر بیشتر باشد.',
"same":'رمز عبور انتخاب شده با تکرار رمز عبور مطابقت ندارد.',
}
PROFILE_REQUIRED = {
"city":'ورود شهر الزامی است',
"address":'ورود آدرس پستی ضروری است',
"state":'انتخاب استان ضروری است',
"email":'ورود پست الکترونیک ضروری است',
"fullName":'ورود نام کامل ضروری است',
"workPlace":'ورود محل کار ضروری است',
}

MESSAGE_REQUIRED = {
"subject":'انتخاب موضوع پیام ضروری است',
"title":'ورود عنوان پیام ضروری است',
"message":'ورود متن پیام ضروری است',
}

MESSAGE_VALIDATION = {
"title":'عنوان پیام حداقل ۴ و حداکثر ۱۲۸ کاراکتر باید باشد',
"message":'متن پیام حداقل ۸ و حداکثر ۲۰۴۸ کاراکتر باید باشد',
}

GUEST_MESSAGE_REQUIRED = {
"fullName":'ورود نام و نام خانوادگی الزامی است',
"email":'ورود ایمیل یا شماره همراه جهت ارتباط ضروری است',
"mobile":'ورود ایمیل یا شماره همراه جهت ارتباط ضروری است',
"sendType":'انتخاب روش فرستادن پیام الزامی است',
"message":'ورود متن پیام الزامی است',
}

GUEST_MESSAGE_VALIDATION = {
"fullName":'نام کامل حداقل ۳ و حد اکثر۱۲۸ کاراکتر می باشد',
"email":'فرمت ایمیل وارد شده صحیح نمی باشد',
"mobile":'شماره همراه وارد شده صحیح نمی باشد',
"sendType":'روش پاسخ به پیام صحیح نمی باشد. دوعبارت موبایل و یا ایمیل مورد تایید هستند',
"message":'حد اقل طول پیام ۸ و حداکثر ۲۰۴۸ کاراکتر می باشد',
}

VERIFICATION_CODEـREQUIRED = {
"code":'ورود کد فعال سازی حساب ضروری است.',
"resend":'ورود فیلد ارسال دوباره الزامی است'
}
AUCTION_REGISTERـREQUIRED = {
"auctionId":'ورود کد حراجی ضروری است.',
"planId":'ورود کد پلن انتخابی ضروری است.'
}
BUY_REQUIRED = {
"chestId":'ورود کد پکیج پیشنهادی ضروری است.',
"gemId":'ورود کد الماس ضروری است.',
"coinId":'ورود کد بسته سکه ضروری است.',
"avatarId":'ورود کد آواتار ضروری است.',
}
PAYMENT = {
"GUID":'ورود شناسه پرداخت ضروری است',
"GUID":'شناسه پرداخت تکراری در سیستم مجاز نیست',
"NOT_FOUND":'پرداختی با شناسه مورد نظر پیدا نشد',
"AUTORITY":'شناسه معتبر از درگاه پرداخت دریافت نشد',
"SUCCESS":'شناسه پرداخت شما آماده است. با تایید پرداخت به صفحه بانک هدایت خواهید شد',
"NOORDERS":'در حال حاضر امکان پرداخت سبد خرید شما میسر نمی باشد.لطفا با پشتیبانی سایت تماس بگیرید.',
}
BUY_NOT_FOUND = {
"chest":'پکیج پیشنهادی مورد نظر موجود نیست.',
"gem":'بسته الماس مورد نظر موجود نیست.',
"coin":'بسته سکه مورد نظر موجود نیست.',
"avatar":'آواتار مورد نظر موجود نیست.',
}

BUY_SUCCESS = {
"chest":'درگاه اینترنتی پرداخت جهت خرید بسته پیشنهادی آماده است',
"gem":'درگاه اینترنتی پرداخت جهت خرید بسته الماس آماده است',
"coin":'درگاه اینترنتی پرداخت جهت خرید بسته سکه آماده است',
"avatar":'آواتار مورد نظر شما با کسر الماس با موفقیت خریداری شد',
}
BUY_CONFIRM = 'در حال برقراری ارتباط با درگاه پرداخت اینترنتی'

MOBILE_REQUIRED = 'ورود شماره همراه الزامی است.'
MOBILE_OR_USERNAME_REQUIRED = 'ورود شماره همراه و یا نام کاربری الزامی است'
USER_ALREADY_REGISTERED = 'نام کاربری مورد نظر شما از قبل در سیستم تعریف شده است.'
MOBILE_ALREADY_EXIST = 'شماره موبایل وارد شده از قبل در سیستم موجود است.'
INVITOR_NOT_EXIST = "کاربری با کد معرفی مورد نظر شما وجود ندارد. لطفا کد معرف خود را بطور صحیح وارد کنید ویا این قسمت را خالی رها کنید. "
MOBILE_NOT_CORRECT = 'شماره موبایل وارد شده معتبر نمی باشد.'
INVITOR_MAX = ".معرف شما از حداکثر تعداد معرفی شدگان خود استفاده کرده است."
BANNED_USER = "متاسفانه حساب کاربری شما در لیست سیاه قرار گرفته است."
MUST_VERIFIED = "حساب کاربری شما باید از طریق شماره همراه فعال سازی شود."
BANNED_USER_NAME = "نام کاربری انتخاب شده شما مناسب نیست. لطفا یک نام کاربری مناسب انتخاب نمایید."
BANNED_USER_NAMES=['کوس','کیر','کس','کص','کون','کیری','کونی','کصی','جنده','جاکش','کصکش','کسکش','فاحشه','kir','kon','koon','kiri','kos','fuck','فاک','fucker','فاکر']
BANNED_EXCEPTION_USER_NAMES=['نکونام','نیکون','دکون','مارکوس','کونیکا']
ACTIVITIES = {
"LOGOUT":'خروج از سایت',
"LOGIN":'ورود به سایت',
"ATTEMPT":'ورود ناموفق',
"AUCTION":'شرکت در حراجی',
"NOT_VERIFIED_LOGIN":'تلاش ورود بدون تایید حساب',
"LOGIN_AFTER_VERIFY":'ورود به سایت پس از تایید حساب کاربری',
"AUCTION_LIKE":'اضافه کردن attribute به علاقمندی ها',
"AUCTION_DIS_LIKE":'حذف attribute از علاقمندی ها',
"AUCTION_EXTRA_BID":'استفاده از پیشنهاد اضافه در attribute',
}
USER_WRONG_PASSWORD = 'رمز عبور شما نادرست است'
VERIFICATION_CODE_MAX_ATTEMPT = "حداکثر تلاش های شما در مدت اعتبار کد ارسالی به انجام رسیده است. لطفا مجددا کد فعال سازی خود را درخواست کنید."
VERIFICATION_CODE_WRONG = 'کد فعال سازی وارد شده معتبر نمی باشد.'
VERIFICATION_CODE_EXPIRED = 'کد فعال سازی وارد شده منقضی شده است.'
MESSAGES ={
'welcome_title':'به سایت یونی بید خوش آمدید',
'welcome_desc': 'به وب سایت ما خوش آمدید. لحظاتی خوبی را در یونی بید برای شما آرزومندیم.',
'welcome_sms':' عزیز٬ '\
+ '\n' + "حساب کاربری شما با موفقیت فعال سازی شد." \
+ '\n' + "با آرزوی موفقیت و شادکامی شما"\
+ '\n' + 'یونی بید'\
+ '\n' + 'www.unibid.ir',
}
VERIFICATION_TOKEN_MISSED = "توکن فعال سازی حساب در دسترس نیست. لطفا دوباره اقدام به ورود به سایت کنید."
MAX_VERIFICATION_RETRY_REACHED = "حد اکثر تلاشهای شما جهت دریافت کد فعال سازی به اتمام رسیده است. لطفا جهت پیگیری با پشتیبانی سایت تماس حاصل کنید."
SMS_ERRORS = {
'UNDEFINED_NUMBER' : "شماره همراه شما در سیستم مخابرات تعریف نشده است لطفا جهت تصحیح شماره همراه حساب کاربری خود با پشتیبانی سایت تماس بگیرید",
'INNER_ERROR' : "ارسال پیام شما با یک خطای داخلی اوپراتور مواجه شده است. لطفا با پشتیبانی سایت تماس حاصل کنید" ,
'WRONG_NUMBER' : "در حال حاضر سیستم قادر به ارسال پیام به شماره همراه شما نمی باشد. لطفا جهت تصحیح شماره همراه با پشتیبانی سایت تماس حاصل کنید"   ,
'SYSTEM_ERROR' : "ارسال پیامک به دلیل اختلال در سیستم پنل پیامکی با مشکل مواجه شده است."\
+ '\n' + 'برای فعال سازی حساب کاربری خود از طریق ایمیل اقدام کنید یا با پشتیبانی سایت تماس حاصل کنید' ,
}
MOBIL_REAPETED = "بیش از یک کاربر با این شماره موبایل در سیستم ثبت شده اند. لطفا جهت پیگیری موضوع با پشتیبانی سایت تماس حاصل کنید."
MOBILE_NOT_FOUND = "کاربری با شماره موبایل وارد شده در سیستم تعریف نشده است"
PASSWORD_SENT_MAX = "حداکثر تلاشهای شما جهت دریافت رمز یکبار مصرف انجام گرفته است. لطفا با پشتیبانی سایت تماس حاصل کنید"
FORGOT_PASSWORD_SENT = "یک پیام متنی حاوی رمز عبور یکبارمصرف برای شما پیامک شد که به وسیله آن می توانید جهت ورود به سایت اقدام کنید."
FORGOT_PASSWORD_PROBLEM = "مشکلی در ارسال رمزعبور شما به شماره همراه اعلام شده در سیستم به وجود آمد. لطفا با پشتیبانی سایت تماس حاصل فرایید"
MOBILE_MUST_NUMBER = "شماره همراه باید به صورت عددی باشد."
AUCTION_PARTICIPATION = {
'AUCTION_PLAN_NOT_FOUND' : 'پلن حراجی مورد نظر شما پیدا نشد.',
'AUCTION_NOT_ACTIVE' : 'حراجی مورد نظر شما موقتا غیر فعال است و امکان ثبت نام در آن وجود ندارد.',
'AUCTION_MAX_MEMBER_REACHED' : 'سقف شرکت در حراجی به اتمام رسیده است.',
'AUCTION_LEVEL_NOT_REACHED' : 'امتیاز حساب کاربری شما برای شرکت در حراجی های این مرحله کافی نمی باشد.',
'USER_NOT_ENOUGH_COINS' : 'موجودی سکه شما برای پلن انتخابی کافی نیست.',
'PLAN_SUCCESS' : 'ثبت نام شما در حراجی با موفقیت انجام شد.',
'AUCTION_EXPIRED' : 'زمان شرکت در حراجی منقضی شده است.',
'AUCTION_DEADLINE' : 'حداکثر تا یک دقیقه به آغاز حراجی می توانید ثبت نام کنید.',
'AUCTION_NOT_FOUND' : 'حراجی مورد نظر جهت ثبت نام وجود ندارد.',
'AUCTION_ALREADY_REGISTERED' : 'شما قبلا در این حراجی شرکت  داده شده اید.',
'USER_NOT_ENOUGH_GEMS' : 'موجودی الماس حساب کاربری شما برای خرید این پلن کافی نمی باشد.',
'USER_LEVEL_NOT_MEET' : 'امتیاز شما جهت شرکت در حراجی های attribute کافی نمی باشد.',
}
AUCTION ={
'LIKE':'attribute به لیست علاقمندی های شما اضافه شد.',
'DISLIKE':'attribute از لیست علاقمندی های شما حذف شد.',
'NOT_FOUND':'حراجی با کد وارد شده پیدا نشد.',
'REQUIRED':'ورود کد حراجی الزامی است.',
'NOT_ACTIVE':'attribute موقتا غیر فعال است.',
'ITEM_NOT_FOUND':'آیتم محصول مورد نظر موجود نیست.',
'NO_EXTRA':'حراجی مورد نظر پیشنهاد اضافه ندارد.',
'SUCCESS_EXTRA_GEM':'در ازای gem عدد الماس bid عدد پیشنهاد به پیشنهادات شما اضافه شد',
'USED_EXTRA':'شما یکبار از پیشنهاد اضافه حراجی استفاده کرده اید.',
'NOT_ENOGH_GEMS':'موجودی الماس شما جهت دریافت پیشنهادات اضافه کافی نمی باشد.',
'DONE':"وقت شرکت در حراجی به اتمام رسیده است.",
'NOT_STARTED_YET':"این عملیات پس از شروع حراجی مجاز است.",
'EXTRA_BID_USED':"قبلا از پیشنهادات اضافه این حراجی استفاده کرده اید.",
'NOT_REGISTERED':"شما در این حراجی ثبت نام نکرده اید و مجاز به انجام این عملیات نیستید.",
'BEFORE_TARGET':"برای این عملیات تا رسیدن به حداقل target عدد پیشنهاد باید صبر کنید",
}

TOKEN = {
'required':"برای این عملیات باید به سایت وارد شوید.",
'verified':"حساب کاربری شما باید فعال سازی شود.",
'banned':"حساب کاربری شما مسدود شده است.",
'notActive':"حساب کاربری شما موقتا غیر فعال است.",
'revoked':"توکن حساب کاربری شما از دسترس خارج شده است.",
'malformed':"توکن کاربر مورد نظر صحیح نمی باشد.",
'unknown':"خطای توکن ناشناخته",
'decode':"خطای دیکد توکن کاربر",
'issue':"خطای ایشوی توکن",
'expired':"توکن حساب کاربری شما منقضی شده است لطفا مجددا به سایت وارد شوید.",
'missed':"توکن مورد کاربر در درخواست موجود نیست."
}

SOCKET = {
'AUCTION_NOT_FOUND':"حراجی مورد نظر پیدا نشد.",
'AUCTION_FINISHED':"وقت شرکت در حراجی به اتمام رسیده است.",
'AUCTION_SYNCRONIZATION':"حراجی در حال همگام سازی پیشنهادات است",
'NOT_PARTICIPATED':"شما در این حراجی شرکت نکرده اید و مجوز ارسال پیشنهاد ندارید.",
'AUCTION_START_DEADLINE':"تا یک دقیقه به شروع حراجی امکان ارسال پیشنهاد وجود ندارد.",
'REAPETED_BID':"امکان ارسال پیشنهاد روی پیشنهاد خود را ندارید.",
'BIDS_FENITTO':"پیشنهادات شما به پایان رسید.",
'ZERO':"سرویس دهنده در حال همگام سازی حراجی است",
'FENITTO':"حراجی بدون پیشنهاد دهنده به پایان رسید.",
}
AVATAR = {
'REAPETED':"آواتار فعلی شما",
'REQUIRED':"یک آواتار انتخاب کنید",
'INVALID':"آواتار وارد شده معتبر نیست",
'GEMS':"الماس موجود در حساب کاربری شما جهت پرداخت این آواتار کافی نیست",
}
ORDER = {
'REQUIRED':"ورود کد سفارش الزامی است",
'INVALID':"کد سفارش وارد شده معتبر نیست",
'REAPETED':"محصول مورد نظر از قبل در سبد خرید شما موجود است.",
'ADD_SUCCESS':"محصول مورد نظر به سبد خرید شما اضافه شد.",
'DELETE_SUCCESS':"محصول مورد نظر با موفقیت از سبد خرید شما حذف شد.",
}
ITEM = {
'REQUIRED':"ورود کد آیتم محصول الزامی است.",
'INVALID':"کد آیتم محصول مورد نظر معتبر نمی باشد.",
'QUANTITY':"تعداد آیتم های این محصول کافی نمی باشد.",
}
USER = {
'PROFILE_SAVED':"اطلاعات پروفایل کاربری شما با موفقیت بروز رسانی شد.",
'AVATAR_CHANGED':"آواتار شما با موفقیت بروز رسانی شد.",
'AVATAR_CHANGED_GEM':"آواتار شما با کسر الماس از حساب کاربریتان با موفقیت بروزرسانی شد",
}

COUPON = {
'REQUIRED':"ورود کوپن تخفیف الزامی است",
'FIXED':"مبلغ تخفیف کوپن در سبد خرید شما اعمال شد. دقت کنید که این تخفیف یکبار قابل انجام است.",
'INVALID':"کوپن تخفیف وارد شده معتبر نمی باشد",
'USED':"تخفیف کوپن قبلا استفاده شده است",
'EXPIRED':"کوپن تخفیف وارد شده منقضی شده است",
'REAPETED':"این کوپن  برای شما لحاظ شده است. در اولین خرید به میزان amount تومان تخفیف دریافت کنید",
'NOT_YOURS':"کوپن تخفیف وارد شده برای استفاده شما معتبر نیست",
'STATUS':"کوپن تخفیف با موفقیت برای شما ثبت شد. دراولین خرید خود به میزان amount تومان تخفیف دریافت خواهید کرد.",
'SYSTEM':"این کوپن تخفیف توسط سیستم باید برای شما فعال شود"
}

NOT_ENOGH_GEMS = 'موجودی الماس شما کافی نیست'

NOTIF = {
"ID": 'ورود کد ناتیفیکیشن ضروری است',
"TYPE":'ورود نوع ناتیفیکیشن ضروری است',
"SUCCESS_DELETE":'ناتیفیکیشن با موفقیت حذف شد',
"SUCCESS_SEEN":'ناتفیفکیشن خوانده شد',
"NOT_FOUND":'ناتیفیکیشن مورد نظر پیدا نشد',
"‌WRONG":'یکی از حروف s یا u  و یا a را بعنوان نوع ناتیفیکیشن ارسال کنید'
}

SUCCESS_MESSAGE = 'پیام شما با موفقیت ارسال گردید. در اولین فرصت پاسخ پیام شما داده خواهد شد'
BAN_MESSAGE = 'تعداد پیامهای شما به پشتیبانی سیستم از حد مجاز نمی تواند عبور کند'
